; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	image3 - mode
	infrared0 - mode
	thermograph1 - mode
	spectrograph2 - mode
	Star4 - direction
	Star7 - direction
	GroundStation8 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	GroundStation9 - direction
	GroundStation1 - direction
	Star10 - direction
	Star0 - direction
	GroundStation6 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Planet13 - direction
	Star14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 Star10)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument1 spectrograph2)
	(supports instrument1 thermograph1)
	(supports instrument1 image3)
	(calibration_target instrument1 GroundStation9)
	(supports instrument2 image3)
	(supports instrument2 thermograph1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 GroundStation9)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 spectrograph2)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star10)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
	(supports instrument4 spectrograph2)
	(supports instrument4 image3)
	(calibration_target instrument4 Star0)
	(supports instrument5 image3)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 GroundStation6)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star7)
)
(:goal (and
	(pointing satellite0 GroundStation5)
	(pointing satellite2 Phenomenon11)
	(have_image Phenomenon11 image3)
	(have_image Planet12 infrared0)
	(have_image Planet13 thermograph1)
	(have_image Star14 spectrograph2)
	(have_image Star15 infrared0)
))

)

; plan
1. (turn_to satellite2 star0 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 star0)
   goals met: 0 of 7
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 7
3. (calibrate satellite2 instrument4 star0)
   added: (calibrated instrument4)
   goals met: 0 of 7
4. (turn_to satellite2 star14 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 star14)
   goals met: 0 of 7
5. (turn_to satellite1 groundstation3 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 groundstation3)
   goals met: 0 of 7
6. (turn_to satellite0 groundstation5 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation5)
   goals met: 1 of 7
7. (take_image satellite2 star14 instrument4 spectrograph2)
   added: (have_image star14 spectrograph2)
   goals met: 2 of 7
8. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 2 of 7
9. (calibrate satellite1 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 2 of 7
10. (turn_to satellite1 planet12 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 planet12)
   goals met: 2 of 7
11. (take_image satellite1 planet12 instrument2 infrared0)
   added: (have_image planet12 infrared0)
   goals met: 3 of 7
12. (turn_to satellite1 planet13 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet13)
   goals met: 3 of 7
13. (take_image satellite1 planet13 instrument2 thermograph1)
   added: (have_image planet13 thermograph1)
   goals met: 4 of 7
14. (turn_to satellite1 star15 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 star15)
   goals met: 4 of 7
15. (take_image satellite1 star15 instrument2 infrared0)
   added: (have_image star15 infrared0)
   goals met: 5 of 7
16. (turn_to satellite2 phenomenon11 star14)
   deleted: (pointing satellite2 star14)
   added: (pointing satellite2 phenomenon11)
   goals met: 6 of 7
17. (take_image satellite2 phenomenon11 instrument4 image3)
   added: (have_image phenomenon11 image3)
   goals met: 7 of 7
